OpenNuvoton/M251BSP/SampleCode/StdDriver/USBD_Mass_Storage_CDROM/MassStorage.c
                USBD_SET_DATA0(EP2);

                break;
            }

            default:
            {
                /* Setup error, stall the device */
                USBD_SetStall(EP0);
                USBD_SetStall(EP1);
                break;
            }
        }
    }
    else
    {
        // Host to device
        switch (au8Buf[1])
        {
            case BULK_ONLY_MASS_STORAGE_RESET:
            {
                /* Check interface number with cfg descriptor and check wValue = 0, wLength = 0 */
                if ((((au8Buf[3] << 8) + au8Buf[2]) == 0) && (((au8Buf[5] << 8) + au8Buf[4]) == 0) && (((au8Buf[7] << 8) + au8Buf[6]) == 0))
                {
                    USBD_SET_DATA1(EP0);
                    USBD_SET_PAYLOAD_LEN(EP0, 0);

                    USBD_LockEpStall(0);

                    /* Clear ready */
                    USBD->EP[EP2].CFGP |= USBD_CFGP_CLRRDY_Msk;
                    USBD->EP[EP3].CFGP |= USBD_CFGP_CLRRDY_Msk;
                    USBD_SET_DATA0(EP2);

                    /* Prepare to receive the CBW */
                    g_u8EP3Ready = 0;
                    g_u8BulkState = BULK_CBW;

                    USBD_SET_DATA1(EP3);
                    USBD_SET_EP_BUF_ADDR(EP3, g_u32BulkBuf0);
                    USBD_SET_PAYLOAD_LEN(EP3, EP3_MAX_PKT_SIZE);
                }
                else     /* Invalid Reset command */
                {
                    USBD_SetStall(EP0);
                    USBD_SetStall(EP1);
                }

                break;
            }

            default:
            {
                // Stall
                /* Setup error, stall the device */
                USBD_SetStall(EP0);
                USBD_SetStall(EP1);
                break;
            }
        }
    }
}

void MSC_ReadTOC(void)
{
    uint32_t u32Len;
    uint8_t u8Format = (g_sCBW.u8LUN & 0x0F) | (g_sCBW.au8Data[7] >> 6);

    if (g_sCBW.u8LUN == 0x02)
    {
        switch (u8Format)
        {
            case 0x00:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;

                if (u32Len > sizeof(g_au8ReadTOC_MSF0))
                    u32Len = sizeof(g_au8ReadTOC_MSF0);

                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_MSF0, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }

            case 0x02:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;

                if (u32Len > sizeof(g_au8ReadTOC_MSF2))
                    u32Len = sizeof(g_au8ReadTOC_MSF2);

                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_MSF2, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }

            default:
                g_au8SenseKey[0] = 0x05;
                g_au8SenseKey[1] = 0x24;
                g_au8SenseKey[2] = 0x00;
        }
    }
    else if (g_sCBW.u8LUN == 0x00)
    {
        switch (g_sCBW.au8Data[0])
        {
            case 0x01:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;

                if (u32Len > sizeof(g_au8ReadTOC_LBA1))
                    u32Len = sizeof(g_au8ReadTOC_LBA1);

                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_LBA1, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }

            case 0x00:
            {
                u32Len = g_sCBW.dCBWDataTransferLength;

                if (u32Len > sizeof(g_au8ReadTOC_LBA0))
                    u32Len = sizeof(g_au8ReadTOC_LBA0);

                g_u8BulkState = BULK_IN;
                USBD_MemCopy((uint8_t *)(USBD_BUF_BASE + USBD_GET_EP_BUF_ADDR(EP2)), g_au8ReadTOC_LBA0, u32Len);
                USBD_SET_PAYLOAD_LEN(EP2, u32Len);
                break;
            }

            default:
                g_au8SenseKey[0] = 0x05;
                g_au8SenseKey[1] = 0x24;
                g_au8SenseKey[2] = 0x00;
                break;
        }
    }
    else
    {
        g_au8SenseKey[0] = 0x05;
        g_au8SenseKey[1] = 0x24;
        g_au8SenseKey[2] = 0x00;

        USBD_SET_EP_STALL(EP2);
        g_u8Prevent = 1;
        g_sCSW.bCSWStatus = 0x01;
        g_sCSW.dCSWDataResidue = 0;
        g_u8BulkState = BULK_IN;
        MSC_AckCmd();
        return;
    }
}

void MSC_GetConfiguration(uint32_t u32Len, uint8_t *pu8Buf)
{
    uint32_t u32Index, u32FeatureLen;
    uint8_t  *pu8Ptr;

    if (g_u8Remove)
    {
        memset((int8_t *)pu8Buf, 0, u32Len);
        return;
    }

    if (g_sCBW.u8LUN == 0x02)
    {
        memcpy(pu8Buf, g_au8GetConfiguration, 8);
        u32FeatureLen = 0;
        // the first feature on the array
        u32Index = 8;

        // find the specified feature
        while (u32Index < sizeof(g_au8GetConfiguration))
        {
            if ((g_au8GetConfiguration[u32Index] == g_sCBW.au8Data[0]) && (g_au8GetConfiguration[u32Index + 1] == g_sCBW.au8Data[1]))
            {
                // copy the feature
                u32FeatureLen = g_au8GetConfiguration[u32Index + 3] + 4;
                memcpy(pu8Buf + 8, &g_au8GetConfiguration[u32Index], u32FeatureLen);
                break;
            }
            else
            {
                u32Index += (g_au8GetConfiguration[u32Index + 3] + 4);
            }
        }

        // fix up return length
        u32Len = 8 + u32FeatureLen;
        pu8Buf[3] = u32Len - 4;
    }
    else if (g_sCBW.u8LUN == 0x01)
    {
        memcpy(pu8Buf, g_au8GetConfiguration, 8);
        pu8Ptr = pu8Buf + 8;

        // the first feature on the array
        u32Index = 8;

        // find current features
        while (u32Index < sizeof(g_au8GetConfiguration))
        {
            u32FeatureLen = g_au8GetConfiguration[u32Index + 3] + 4;

            if (g_au8GetConfiguration[u32Index + 2] & 0x01)    // check current bit
            {
                memcpy(pu8Ptr, &g_au8GetConfiguration[u32Index], u32FeatureLen);
                pu8Ptr += u32FeatureLen;
            }

            u32Index += u32FeatureLen;
        }

        u32Len = pu8Ptr - pu8Buf;
        pu8Buf[3] = u32Len - 4;
    }
    else if (g_sCBW.u8LUN == 0x00)
        memcpy((char *)pu8Buf, &g_au8GetConfiguration[0], sizeof(g_au8GetConfiguration));
    else
    {
        g_au8SenseKey[0] = 0x05;
        g_au8SenseKey[1] = 0x24;
        g_au8SenseKey[2] = 0x00;
    }
}

void MSC_GetEventStatusNotification(void)
{
    uint32_t u32Len;

